# RenderDuration Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
RenderingQualitySettings..::..RenderDuration Property
RenderingQualitySettings Class See Also
---
A value that controls render duration.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public RenderDuration RenderDuration { get; set; }
```

Visual Basic
---
```text
Public Property RenderDuration As RenderDuration
	Get
	Set
```

Visual C++
---
```text
public:
property RenderDuration RenderDuration {
	RenderDuration get ();
	void set (RenderDuration value);
}
```

# Remarks
The duration of rendering.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: The value is not valid for RenderDuration. -or- When setting this property: A value passed for an enumeration argument is not a member of that enumeration |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | When setting this property: The RenderingQualitySettings does not use custom quality currently. To use custom quality, set RenderingQuality property to RenderingQuality.Custom. |

# See Also
RenderingQualitySettings Class
Autodesk.Revit.DB Namespace